package com.app.mapsexample.viewmodel

import androidx.lifecycle.ViewModel
import com.app.mapsexample.model.Coupon

class MainViewModel:ViewModel() {
    fun showCoupon():List<Coupon>{
        return listOf(
            Coupon(0, "150 сомони скидки на смартфоны", 38.5670, 68.7537),
            Coupon(1, "200 сомони выгоды на ноутбуки", 38.5800, 68.7414),
            Coupon(2, "100 сомони скидки на полосос", 38.5461, 68.7555),
            Coupon(3, "15 % дополнительной скидки на одежду", 38.5587, 68.7642),
            Coupon(4, "50 сомони на первый заказ в приложении!", 38.5405, 68.7623),
            Coupon(5, "25% на посуду", 38.5116, 68.7620),
            Coupon(6, "250 сомони на первый заказ", 38.5811, 68.7937),
            Coupon(7, "11 % скидки на малыщей!", 38.5974, 68.7647),
            Coupon(8, "20 % скидки на товары для туризма", 38.5839, 68.7513),
            Coupon(9, "150 сомони на ВСЕ!", 38.6148, 68.7761),
            Coupon(10, "15% скидки на школу!", 38.5960, 68.7919),
            Coupon(11, "200 сомони на детское питание!", 38.5822, 68.7634),
            Coupon(12, "10% скидки на женское косметики!", 38.5714, 68.8008),
            Coupon(13, "130 сомони на спортивное крассовки!", 38.5587, 68.8265),
            Coupon(14, "5% скидки на укращение!", 38.5360, 68.8302),
            Coupon(15, "220 сомони на мужское бельё!", 38.5137, 68.7911),
            Coupon(16, "25% скидки на праздничный стол!", 38.5561, 68.7348),
            Coupon(17, "150 сомони на первый заказ торта!", 38.5467, 68.6964),
            Coupon(18, "22% скидки на мебел!", 38.5369, 68.7209),
            Coupon(19, "130 сомони за первую закупку!", 38.4926, 68.7378),
        )
    }
}