package com.app.mapsexample

import androidx.lifecycle.ViewModel

class MainViewModel:ViewModel() {
    fun showCoupon():List<Coupon>{
        return listOf(
            Coupon(0, "150 сомони скидки на смартфоны", 38.56704716204951, 68.75379549155022),
            Coupon(1, "200 сомони выгоды на ноутбуки", 38.58006517252117, 68.74147878801946),
            Coupon(2, "100 сомони скидки на полосос", 38.5461, 68.7555),
            Coupon(3, "15 % дополнительной скидки на одежду", 38.55879225335408, 68.76422392022164),
            Coupon(4, "50 сомони на первый заказ в приложении!", 38.54053412875694, 68.76233564523204),
            Coupon(5, "25% на посуду", 38.5116, 68.7620),
            Coupon(6, "250 сомони на первый заказ", 38.58110516961449, 68.79374967687772),
            Coupon(7, "11 % скидки на малыщей!", 38.59744121047443, 68.76478182028964),
            Coupon(8, "20 % скидки на товары для туризма", 38.58399024395022, 68.75134931752567),
            Coupon(9, "150 сомони на спортивное питание!", 38.5827825524511, 68.73508440226865),
        )
    }
}